# ValidateCurveLoopsOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValidateCurveLoopsOptions Class
Members See Also
---
Options for array of curve loops validation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class ValidateCurveLoopsOptions : IDisposable
```

Visual Basic
---
```text
Public Class ValidateCurveLoopsOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ValidateCurveLoopsOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ValidateCurveLoopsOptions
# See Also
ValidateCurveLoopsOptions Members
Autodesk.Revit.DB Namespace